Revit 2024 API
Plane.XVec Property
 Axis defining the first parametric direction of the plane.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public XYZ XVec { get; }
Visual Basic
Public ReadOnly Property XVec As XYZ
	Get
Visual C++
public:
property XYZ^ XVec {
	XYZ^ get ();
}
See Also
Plane Class
Autodesk.Revit.DB Namespace